early_models/flapping_wing_3d_overset/backGround/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  7                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (-16.0 -10.0 -20)
    ( 16.  -10.0 -20)
    ( 16.   20.0 -20)
    (-16.0  20.0 -20)
    (-16.0 -10.0  10)
    ( 16.  -10.0  10)
    ( 16.   20.0  10)
    (-16.0  20.0  10)
);

blocks
(
    //hex (0 1 2 3 4 5 6 7) (70 50 1) simpleGrading (1 1 1)
    hex (0 1 2 3 4 5 6 7) (64 60 60) simpleGrading (1 1 1)
);

edges
(
);

boundary
(   

    oversetPatch
    {
        type overset;
        faces ();
    }

    top
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }
    Bottom
    {
        type patch;
        faces
        (
            (1 5 4 0)
        );
    }
    left
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    Right
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
    frontAndBack
    {
        type patch;
        faces
        (
            (4 5 6 7)
            (0 3 2 1)
        );
    }

);

mergePatchPairs
(
);

// ************************************************************************* //
