early_models/flapping_wing_3d_overset/backGround/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  7                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    //default        Gauss linear;
    //default 	     cellLimited leastSquares 1;
    default 	     cellLimited Gauss linear 1;

    //grad(p)        Gauss linear;
    //grad(U) 	     cellMDLimited Gauss linear 1;
}

divSchemes
{
    default         	none;

    //div(phi,U)      	Gauss linear;
    //div(phi,U)      	Gauss limitedLinearV 1;
    div(phi,U)      	Gauss linearUpwindV default;
    //div(phi,U)      	Gauss upwind;

    //div(phi,omega) 	Gauss linearUpwind default;
    //div(phi,epsilon) 	Gauss linearUpwind default;
    //div(phi,k) 	Gauss linearUpwind default;

    div((nuEff*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear limited 1;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         limited 1;
}

oversetInterpolation
{
    method          inverseDistance;
}

wallDist
{
    method 	    meshWave;
}

/*
fluxRequired
{
    default         no;
    pcorr           ;
    p               ;
}
*/

// ************************************************************************* //
